---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.IsMappedProductList
source: html/e66d5b0e-e9d3-bceb-ab4b-63de581faf3e.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.IsMappedProductList Property

Are the mapped sizes for a product listed fabrication part.

## Syntax (C#)
```csharp
public bool IsMappedProductList { get; set; }
```